const xieyi = '小程序用户隐私政策及协议\n'+
'该小程序（以下或称“我们”）注重保护您个人信息及个人隐私。本政策解释了用户个人信息（以下或称“信息”） 收集和使用的有关情況和程序使用 知及免責声明，本政策适用于该小程序向您提供的所有相关服务。如果悠不同意本隐私政策的任何内容，您座立即停止使用该小程序。当您使用该小程序提供的任一服务时，即表示您已同意我们按照本隐私政策来合法使用和保护您的个人信息。\n'
+'一、我们如何收集和使用您的个人数据\n'+
'1.1 个人数据的范围\n'+
'个人数据是指单独使用或结合其他信息使用时能够确定个人身份的信息，包括但不限于：\n'+
'（1）在您注册我们时，您提供的个人数据；\n'+
'（2）我们因为您访问和使用我们的网站网页或服务而接收并记录的您的相关信息，包括但不限于您访问的网页记录、访问日期和时间、使用的浏览器的信息（类型、时区、插件、语言、宇体、canvas图片渲染哈希值、webgl图片渲染哈希值等）、您在页面上的鼠标和键盘操作信息、软硬件特征、网络链接信息（P地址、端口、网络协议等）等数据；\n'+
'（3）您与我们互动或因使用服务或获得支持和帮助时提供的个人数据；\n'+
'（4）我们通过合法途径从商业伙伴处或第三方取得的数据。例如在法律允许的情况下，我们会从公用和商用第三方来源获取有关数据来支持我们的服务。 通常情况下，您不需要提供个人数据就可以浏览我们网站的对外公开信息。为了给您提供服务，我们会按照本隐私政策的规定保护、使用和披露您的个人数据。为达到服务之目的，如果您以自愿填写的方式或根据要求提供注册或订阅所需的姓名、性别、证件种类及证件号、出生年月日、国籍、电子邮件信箱、电话、联系地址和邮政编码、所希望提供的服务或喜好信息、客户代码以及其他类似的个人数据，则表示您已经了解并接受我们依照本隐私政策对您的个人数据的收集、保护和使用。\n'+
'1.2 非个人数据范围\n'+
'非个人数据包括但不限于：\n'+
'（1）在使用我们的网站提供服务时您所发布、公布的信息；\n'+
'（2）我们已对您采取的包括但不限于信用评价、违反法律法规规定或违反我们政策的处理措施等相关信息；\n'+
'（3）我们还可能收集和使用非识别性数据。非识别性数据是指无法单独用于确定个人身份的数据。例如，我们会收集汇总的统计数据，例如网站访问量。我们收集此数据的目的在于了解您如何使用自己的网站、产品和服务。借此，我们可以改善自己的服务，更好地满足客户需求。我们可能会自行決定出于其他目的的收集、使用、处理、转移或披露非识别性数据。我们会尽力隔离您的个人数据和非识别性数据，并单独使用这两种数据。如果个人数据摻杂了非识别性数据，依旧会被视作个人数据处理。\n'+
'末经我们事先同意，您不应向我们提供我们末明确要求的、可能致使我们在本政策之外被附加额外法律义务的信息。\n'+
'1.3 个人数据的使用我们可能将您的个人数据用于以下目的：\n'+
'（1）履行订单；交付、激活或验证产品或服务；应您的要求进行变更；以及提供技术支持和服务；\n'+
'（2）向您发送重要通知；\n'+
'（3）开展内部审计、数据分析和研究，改善我们的产品和服务；\n'+
'（4）分析业务运营效率并衡量市场份额；\n'+
'（5）改善我们的防损和反欺诈计划；\n'+
'（6）遵从和执行适用的法律法规要求，相关的行业标准或我们的政策；\n'+
'（7）其它为向您提供服务而需要使用您个人数据的情形。\n'+

'二、我们如何披露您的个人数据\n'+
'末经您事先同意，我们承诺不会出售您的个人数据。我们会在法律允许的范围内根据本政策使用您提供的个人数据。但我们可能会根据法律法规、司法机构、执法机构、监管机构或政府部门的要求向这些部门提供您的个人数据；或在诉讼、仲裁等法律或争议解决程序中披露；或在我们认为有必要这样做来保护我们、客户或公众利益时，也可能在尽可能小的范国内公开某些个人数据。在您提供个人数据时，您理解并同意我们将在某些情形中使用或向第三方提供您的个人数据，包括但不限于如下情形：\n'+
'（1）根据法律法规的有关规定，或者应行政或司法执法及监管机构的要求，向第三方或者行政机关、司法机构、执法机构或监管机构披露；\n'+
'（2）如您出现违反所适用的法律、法规或我们服务协议或相关政策的情况，需要向第三方披露；\n'+
'（3）为向您提供或因使用您所订购或要求的产品和服务时，而需要和第三方披露；\n'+
'（4）其它我们根据法律、法规或者网站政策认为合适的披露，例如出于执行条款与条件或为阻止人身、财产损失或非法行为的目的；\n'+
'（5）除非得到您的许可，或本政策约定的其它情形，或因该第三方作为我们的服务提供商/分包商/授权中心向您提供服务，我们不会向无关第三方提供、出售或出租您的个人数据。\n'+
'（6）网络链接信息可能被用于网络攻击检测；\n'+
'（7）在诉讼、仲裁等法律或争议解决程序中。\n'+

'三、用户信息的保护\n'+
'（1）我们重视个人数据的安全。我们采用适当的物理、管理和技术保障措施来保护您的个人数据不被未经授权访问、披露、使用、修改、损坏或丟失。例如，我们会使用加密技术确保数据的机密性；我们会使用保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人数据；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人数据重要性的认识。我们将会在达成本政策所述目的所需的期限内保留您的个人数据，除非需要延长保留期或受到法律的允许。我们会尽力保护您的个人数据，但是请注意任何安全措施都无法做到无懈可击；\n'+
'（2）尽管有前述安全措施，但妥善保管您的账户及密码及其他信息的安全是悠的责任和义务，因您末能保管好账户和密码而导致的法律责任由您全部承担；\n'+
'（3）如果发现您账号或密码被他人非法使用或有使用异常的情况的，应及时通知我们，您可要求我们采取措施暂停您账户的登录和使用。\n'+
'（4）如不幸发生信息泄露等安全事件，我们将依照适用的法律法规的要求，向您和或主管机关告知数据泄露事件的相关信息。如果因完全归因于我们的原因造成您的信息泄露，在我们确认相关数据泄露事件及根因后，我们将尽努力第一时问间向您发送数据泄露的通知。\n'+

'四、您发布内容规范\n'+
'1、本条所述内容是指您使用服务的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。\n'+
'2、您不得利用账号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：\n'+
'（1）反对宪法所确定的基本原则的；\n'+
'（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；\n'+
'（3）损害国家荣誉和利益的；\n'+
'（4）煽动民族仇恨、民族歧视，破坏民族团结的；\n'+
'（5）破坏国家宗教政策，宣扬邪教和封建迷信的；\n'+
'（6）散布谣言，扰乱社会秩序，破坏社会稳定的；\n'+
'（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；\n'+
'（8）侮辱或者诽谤他人，侵害他人合法权益的；\n'+
'（9）含有法律、行政法规禁止的其他内容的信息。\n'+
'3、您不得利用账号或本服务制作、上载、复制、发布、传播如下千扰”服务”正常运营，以及侵犯其他用户或第三方机构合法权益的内容：\n'+
'（1）含有任何性或性暗示的；\n'+
'（2）含有辱骂、恐吓、威胁内容的；\n'+
'（3）含有骚扰、垃圾广告、恶意信息、诱骗信息的；\n'+
'（4）涉及他人隐私、信息或资料的；\n'+
'（5）侵害他人名營权、肖像权、知识产权、商业秘密等合法权利的；\n'+
'（6）含有其他千扰本服务正常运营和侵犯其他您或第三方合法权益内容的信息。\n'+

'五、免责声明\n'+
'（1）您通过安装本系统软件提供的服务与功能即表示您已经同意与本系统建立同意本协议。本系统可随时执行全权决定更改“条款”。如“条款”有任何变更，本系统官方网站上刊载公告作为通知。经修订的“条款”一经在官方网站上公布后，立即自动生效。\n'+
'（2）一切因使用本系统软件而引致之任何意外、疏忽、合约毁坏、诽谤、版权或知识产权侵犯及其所造成的损失，本系统概不负责，与本系统开发服务商无关，亦不承担任何法律责任。\n'+
'（3）用户使用本软件系统自行承担风险，我们作为系统开发商不做任何形式的保证,因网络状況、通讯线路等任何技术原因而导致用户不能正常升级更新，我们也不承担任何法律责任。\n'+
'（4）任何单位或个人不得在没有本系统软件授权的情況下对软件进行二次开发、功能修改和反编译。本系统软件开发商保留版权与著作权。\n'+
'（5）我们提供的软件经营主体应接受合法、合规用途，不得利用本软件系统从事违法经营活动，我们仅作为软件开发商，对任何经营结果不做任何连带责任，软件使用过程中产生的任何法律后果我们概不负责，亦不承担任何法律责任。\n'+
'（6）系统的版权：本系统开发服务商对所有开发的或合作开发的产品拥有知识产权，著作权，版权和使用权，这些产品受到适用的知识产权、版权、商标、服务商标、专利或其他法律的保护。\n'+
'（7）传播任何公司或个人在网络上发布，传播我们软件的行为都是允许的，但因公司或个人传播软件可能造成的任何法律和刑事事件于我们开发商不负任何责任。\n'+
'（8）如果未同意本协议，而通过其他手段强制使用本程序（包括本程序内含的部分功能，api、识别等），所造成的的任何后果均由使用人承担，与我们无关。\n'+
'（9）请严格遵守国家法律和本协议要求使用，如果违规使用本程序，或间接使用本程序从事违法、违规行为，造成的一切后果由用户承担，与本程序无关，并且因此对本程序造成的影响及损失，我们有权上诉并求情相应赔偿。\n'+

'六、使用Cookie\n'+
'Cookie是由网页服务器存放在您的访问设备上的文本文件。指定给您的Cookie 是唯一的，它只能被将Cookie发布给您的域中的web服务器读取。我们使用 Cookie 来帮助悠实现您的联机体验的个性化，使您在我们及其关联方获得更轻松的访问体验。例如，Cookie 会帮助您在后续访问我们网站时调用悠的信息，简化记录悠填写信息（例如一键登录等）的流程；为您提供安全购物的偏好设置；帮助您优化对广告的选择与互动；保护您的数据安全等。您有杈接受或拒绝 Cookie。大多数浏览器会自动接受Cookie,但您通常可根据自己的需要来修改浏览器的设貴以拒绝 Cookie。如果选择拒绝 Cookie，那么您可能无法完全体验所访问的我们网站或某些服务的全部功能。\n'+

'七、末成年人的信息保护\n'+
'我们非常重视对未成年人信息的保护。若您是18周岁以下的未成年人，在使用我们服务前，应事先取得您家长或法定监护人的书面同意。我们根据国家相关法律法规的规定保护末成年人的信息。\n'+

'人、通知和修订\n'+
'为给你提供更好的服务，我们的业务将不时变化，本隐私政策也将随之调整。我们会在我们网站、移动端上发出更新版本并提醒您相关内容的更新，也请您访问我们以便及时了解最新的隐私政策。如果您对于本隐私政策或在使用我们服务时对于您的信息或隐私情况有任何问题，请联系我们客服并作充分描述，我们将尽力解决。'

module.exports.xieyi = xieyi